Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--mapserver_quickstart.tmx
Source language: en
Languages: ja

source: MapServer is an `Open Source <https://opensource.org/>`_ server based application that allows you to publish geographic map images and vector data through the internet using |OGCS| such as |WMS|, |WFS| and |WCS|.
ja: MapServerは、 `オープンソース <https://opensource.org/>`_ サーバーベースのアプリケーションであり、|WMS|、|WFS|、|WCS|などの |OGCS| を使用して、インターネットを介して地理的地図の画像やベクターデータを公開できます。

source: The `Mapfile <https://mapserver.org/mapfile/index.html>`_ is the configuration file that MapServer uses to render geospatial data as images or vector data.
ja: `Mapfile <https://mapserver.org/mapfile/index.html>`_ は、MapServerが地理空間データを画像またはベクターデータとしてレンダリングするために使用する設定ファイルです。

source: Its main purpose is to define the layers it can draw, how to read necessary data, and how to render it (e.g. color, symbol, label, etc...).
ja: その主な目的は、描画できるレイヤー、必要なデータの読み取り方法、およびレンダリング方法（色、シンボル、ラベルなど）を定義することです。

source: Put the following content in it::
ja: 次の内容を入力します::

source: A complete list of the available objects and properties a Mapfile can have can be found in the `MapServer documentation page <https://mapserver.org/mapfile/index.html>`_.
ja: Mapfileで使用できるオブジェクトとプロパティの完全なリストは、 `MapServerドキュメントページ <https://mapserver.org/mapfile/index.html>`_ にあります。

source: In a Mapfile, a LAYER object can contain an infinite number of CLASS objects.
ja: Mapfileでは、LAYERオブジェクトに無数のCLASSオブジェクトを含めることができます。

source: These are used to style the elements contained in the spatial data file (DATA).
ja: これらは、空間データファイル（DATA）に含まれる要素のスタイルを設定するために使用されます。

source: For example, if we look closer at our "ne_10m_lakes" data file using a tool such as `ogrinfo <https://gdal.org/ogrinfo.html>`_, we'll see the geometry and attribute definitions it contains.
ja: たとえば、`ogrinfo <https://gdal.org/ogrinfo.html>`_ などのツールを使用して "ne_10m_lakes" データファイルを詳しく見ると、ジオメトリと属性の定義が表示されます を含む。

source: These attribute values can be used as a way to draw the elements inside a dataset differently using multiple CLASS objects.
ja: これらの属性値は、複数のCLASSオブジェクトを使用してデータセット内の要素を異なる方法で描画する方法として使用できます。

source: Learn more about `EXPRESSIONS <https://mapserver.org/mapfile/expressions.html>`_ in MapServer.
ja: MapServerの `EXPRESSIONS <https://mapserver.org/mapfile/expressions.html>`_ の詳細をご覧ください。

source: What Next?
ja: 次のステップ

source: Read the `Introduction to MapServer <https://mapserver.org/introduction.html#introduction>`_.
ja: `MapServerの概要 <https://mapserver.org/introduction.html#introduction>`_を読む

source: Have a look at the `MapServer Tutorial <https://www.mapserver.org/tutorial/index.html>`_ which contains more Mapfile examples.
ja: `MapServerチュートリアル <https://www.mapserver.org/tutorial/index.html>`_ をご覧ください

source: Check the `OGC Support and Configuration <https://www.mapserver.org/ogc/index.html>`_ to learn more about OGC standards in MapServer (WMS, WFS, SLD, WFS Filter Encoding, WCS, SOS, etc.).
ja: `OGC サポートと構成 <https://www.mapserver.org/ogc/index.html>`_をチェックして、MapServerのOGC標準（WMS、WFS、SLD、WFS Filter Encoding、WCS、SOSなど）の詳細を確認してください。

source: Ready to use MapServer?
ja: MapServerを使用する準備はできましたか？

source: Then join the community on the `Mailing Lists <https://www.mapserver.org/community/lists.html>`_ to exchange ideas, discuss potential software improvements and ask questions.
ja: 次に、`メーリングリスト<https://www.mapserver.org/community/lists.html>` _のコミュニティに参加して、アイデアを交換したり、ソフトウェアの改善点について話し合ったり、質問したりします。
